1066mutex/QP_keil_based_tm4c123/bsp.c
/*****************************************************************************
* Product: DPP example, EK-TM4C123GXL board, FreeRTOS kernel
* Last Updated for Version: 6.0.4
* Date of the Last Update:  2018-01-10
*
*                    Q u a n t u m     L e a P s
*                    ---------------------------
*                    innovating embedded systems
*
* Copyright (C) Quantum Leaps, LLC. All rights reserved.
*
* This program is open source software: you can redistribute it and/or
* modify it under the terms of the GNU General Public License as published
* by the Free Software Foundation, either version 3 of the License, or
* (at your option) any later version.
*
* Alternatively, this program may be distributed and modified under the
* terms of Quantum Leaps commercial licenses, which expressly supersede
* the GNU General Public License and are specifically designed for
* licensees interested in retaining the proprietary status of their code.
*
* This program is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
* GNU General Public License for more details.
*
* You should have received a copy of the GNU General Public License
* along with this program. If not, see <http://www.gnu.org/licenses/>.
*
* Contact information:
* https://state-machine.com
* mailto:info@state-machine.com
*****************************************************************************/
#include "qpc.h"
#include "bsp.h"
#include "dpp.h"
#include "bsp_bp.h"
#include "ports.h"
#include "profile.h"

#include "TM4C123GH6PM.h" /* the device specific header (TI) */
#include "UART0.h"        //! used for testing uart device
#include "rom.h"    /* the built-in ROM functions (TI) */
#include "sysctl.h" /* system control driver (TI) */
#include "gpio.h" /* GPIO driver (TI) */
#include "hw_i2c.h"
/* add other drivers if necessary... */

#define TIMER_1A_PSV (TIMER1->TAPV)                    // TIMER prescaler value.
#define TIMER_1A_CLK (SystemCoreClock / TIMER_1A_PSV)  // timer 1A clk

#define PWM_CYCLES (SystemCoreClock / 2048)  // time reload value for RGB (pwm) leds.

Q_DEFINE_THIS_FILE /* define the name of this file for assertions */

    /*!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! CAUTION !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
* Assign a priority to EVERY ISR explicitly by calling NVIC_SetPriority().
* DO NOT LEAVE THE ISR PRIORITIES AT THE DEFAULT VALUE!
*/
    enum KernelUnawareISRs { /* see NOTE1 */
                             // UART0_PRIO,
                             /* ... */
                             MAX_KERNEL_UNAWARE_CMSIS_PRI /* keep always last */
    };
/* "kernel-unaware" interrupts can't overlap "kernel-aware" interrupts */
Q_ASSERT_COMPILE(
    MAX_KERNEL_UNAWARE_CMSIS_PRI <= (configMAX_SYSCALL_INTERRUPT_PRIORITY >> (8 - __NVIC_PRIO_BITS)));

enum KernelAwareISRs {
    SYSTICK_PRIO = (configMAX_SYSCALL_INTERRUPT_PRIORITY >> (8 - __NVIC_PRIO_BITS)),  //5
    GPIOA_PRIO = (configMAX_SYSCALL_INTERRUPT_PRIORITY >> (8 - __NVIC_PRIO_BITS)),    //5
    UART1_PRIO = (configMAX_SYSCALL_INTERRUPT_PRIORITY >> (8 - __NVIC_PRIO_BITS)),    //5
    UART0_PRIO = (configMAX_SYSCALL_INTERRUPT_PRIORITY >> (8 - __NVIC_PRIO_BITS)),
    ADC1SS3_PRIO, /* ADC0 SS3 priority */

    /* ... */
    MAX_KERNEL_AWARE_CMSIS_PRI /* keep always last */

};
/* "kernel-aware" interrupts should not overlap the PendSV priority */
Q_ASSERT_COMPILE(MAX_KERNEL_AWARE_CMSIS_PRI <= (0xFF >> (8 - __NVIC_PRIO_BITS)));

/* booster pack LCD display.................................................*/
// Rather than a bazillion writecommand() and writedata() calls, screen
// initialization commands and arguments are organized in these tables
// stored in ROM.  The table may look bulky, but that's mostly the
// formatting -- storage-wise this is hundreds of bytes more compact
// than the equivalent code.  Companion function follows.
#define DELAY 0x80

/* Local-scope objects ------------------------------------------------------*/
static uint32_t l_rnd;  // random seed

#ifdef Q_SPY

QSTimeCtr QS_tickTime_;
QSTimeCtr QS_tickPeriod_;

/* QS identifiers for non-QP sources of events */
static uint8_t const l_TickHook = (uint8_t)0;
static uint8_t const l_GPIOPortA_IRQHandler = (uint8_t)0;

#define UART_BAUD_RATE 115200U
#define UART_FR_TXFE (1U << 7)
#define UART_FR_RXFE (1U << 4)
#define UART_TXFIFO_DEPTH 16U

enum AppRecords { /* application-specific trace records */
                  PHILO_STAT = QS_USER,
                  PAUSED_STAT,
                  COMMAND_STAT
};

#endif
/* Local-scope functions ------------------------------------------------------*/
void mcuTempSensorInit(void);
static void l_adcinit1(void);
/* ISRs used in this project ===============================================*/

/* NOTE: this ISR is for testing of the various preemption scenarios
*  by triggering the GPIOPortA interrupt from the debugger. You achieve
*  this by writing 0 to the  SWTRIG register at 0xE000,EF00.
*
*  Code Composer Studio: From the CCS debugger you need open the register
*  window and select NVIC registers from the drop-down list. You scroll to
*  the NVIC_SW_TRIG register, which denotes the Software Trigger Interrupt
*  Register in the NVIC. To trigger the GPIOA interrupt you need to write
*  0x00 to the NVIC_SW_TRIG by clicking on this field, entering the value,
*  and pressing the Enter key.
*
*  IAR EWARM: From the C-Spy debugger you need to open Registers view and
*  select the "Other Systems Register" group. From there, you need to write
*  0 to the STIR write-only register and press enter.
*/
/* NOTE: only the "FromISR" FreeRTOS API variants are allowed in the ISRs! */
void GPIOPortA_IRQHandler(void); /* prototype */
void GPIOPortA_IRQHandler(void) {
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;

    /* for testing... */
    QACTIVE_POST_FROM_ISR(AO_Table,
                          Q_NEW_FROM_ISR(QEvt, MAX_PUB_SIG),
                          &xHigherPriorityTaskWoken,
                          &l_GPIOPortA_IRQHandler);

    /* the usual end of FreeRTOS ISR... */
    portEND_SWITCHING_ISR(xHigherPriorityTaskWoken);
}
/*..........................................................................*/
/* TODO: implement
* Move all my ISR to this section 
*/

#ifdef Q_SPY
/*
* ISR for receiving bytes from the QSPY Back-End
* NOTE: This ISR is "kernel-unaware" meaning that it does not interact with
* the FreeRTOS or QP and is not disabled. Such ISRs don't need to call
* portEND_SWITCHING_ISR(() at the end, but they also cannot call any
* FreeRTOS or QP APIs.
*/
void UART0_IRQHandler(void) {
    uint32_t status = UART0->RIS; /* get the raw interrupt status */
    UART0->ICR = status;          /* clear the asserted interrupts */

