1066mutex/QP_keil_based_tm4c123/bsp.c
/* TFT spi I/O BoosterPack ..............................................................*/

void BSP_BP_TFT_CS_LOW(void) {
    BP_SPI_CS_PORT->DATA_Bits[BP_SPI_CS_PIN] = 0U;
}
//...........................................................................
void BSP_BP_TFT_CS_HIGH(void) {
    BP_SPI_CS_PORT->DATA_Bits[BP_SPI_CS_PIN] = BP_SPI_CS_PIN;
}
//...........................................................................
void BSP_BP_TFT_RESET_HIGH(void) {
    BP_LCD_RST_PORT->DATA_Bits[BP_LCD_RST_PIN] = BP_LCD_RST_PIN;
}
//...........................................................................
void BSP_BP_TFT_RESET_LOW(void) {
    BP_LCD_RST_PORT->DATA_Bits[BP_LCD_RST_PIN] = 0U;
}
//...........................................................................
void BSP_BP_TFT_DC_COMMAND(void) {
    BP_LCD_RS_PORT->DATA_Bits[BP_LCD_RS_PIN] = 0U;
}
//...........................................................................
void BSP_BP_TFT_DC_DATA(void) {
    BP_LCD_RS_PORT->DATA_Bits[BP_LCD_RS_PIN] = BP_LCD_RS_PIN;
}
//...........................................................................

// TODO: will not need this but a good example on toggling leds as display.
void BSP_displayPhilStat(uint8_t n, char const *stat) {
    GPIOF->DATA_Bits[LED_RED] =
        ((stat[0] == 'e') /* Is Philo[n] eating? */
             ? 0xFFU      /* turn the LED1 on  */
             : 0U);       /* turn the LED1 off */

    QS_BEGIN(PHILO_STAT, AO_Philo[n]) /* application-specific record begin */
    QS_U8(1, n);                      /* Philosopher number */
    QS_STR(stat);                     /* Philosopher status */
    QS_END()
}
/*..........................................................................*/
void BSP_displayPaused(uint8_t paused) {
    GPIOF->DATA_Bits[LED_RED] = ((paused != 0U) ? 0xFFU : 0U);

    QS_BEGIN(PAUSED_STAT, (void *)0) /* application-specific record begin */
    QS_U8(1, paused);                /* Paused status */
    QS_END()
}
/*..........................................................................*/
uint32_t BSP_random(void) { /* a very cheap pseudo-random-number generator */
    uint32_t rnd;

    /* exercise the FPU with some floating point computations */
    /* NOTE: this code can be only called from a task that created with
    * the option OS_TASK_OPT_SAVE_FP.
    */
    float volatile x;
    x = 3.1415926F;
    x = x + 2.7182818F;

    vTaskSuspendAll(); /* lock FreeRTOS scheduler */
    /* "Super-Duper" Linear Congruential Generator (LCG)
    * LCG(2^32, 3*7*11*13*23, 0, seed)
    */
    rnd = l_rnd * (3U * 7U * 11U * 13U * 23U);
    l_rnd = rnd;      /* set for the next time */
    xTaskResumeAll(); /* unlock the FreeRTOS scheduler */

    return (rnd >> 8);
}
/*..........................................................................*/
void BSP_randomSeed(uint32_t seed) {
    l_rnd = seed;
}
/*..........................................................................*/
void BSP_terminate(int16_t result) {
    (void)result;
}

/* QF callbacks ============================================================*/
void QF_onStartup(void) {
    /* set up the SysTick timer to fire at BSP_TICKS_PER_SEC rate */
    SysTick_Config(SystemCoreClock / BSP_TICKS_PER_SEC);

    /* assing all priority bits for preemption-prio. and none to sub-prio. */
    NVIC_SetPriorityGrouping(0U);

    /* set priorities of ALL ISRs used in the system, see NOTE00
    *
    * !!!!!!!!!!!!!!!!!!!!!!!!!!!! CAUTION !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
    * Assign a priority to EVERY ISR explicitly by calling NVIC_SetPriority().
    * DO NOT LEAVE THE ISR PRIORITIES AT THE DEFAULT VALUE!
    */
    NVIC_SetPriority(UART0_IRQn, UART0_PRIO);
    NVIC_SetPriority(SysTick_IRQn, SYSTICK_PRIO);
    NVIC_SetPriority(GPIOA_IRQn, GPIOA_PRIO);
    NVIC_SetPriority(ADC1SS3_IRQn, ADC1SS3_PRIO);
    NVIC_SetPriority(UART1_IRQn, UART1_PRIO);
    NVIC_SetPriority(UART0_IRQn, UART0_PRIO);
    /* ... */

    /* enable IRQs... */
    NVIC_EnableIRQ(GPIOA_IRQn);
    NVIC_EnableIRQ(ADC1SS3_IRQn);
    NVIC_EnableIRQ(UART1_IRQn);
    NVIC_EnableIRQ(UART0_IRQn);

#ifdef Q_SPY
    NVIC_EnableIRQ(UART0_IRQn); /* UART0 interrupt used for QS-RX */
#endif
}
/*..........................................................................*/
void QF_onCleanup(void) {
}

/*..........................................................................*/
void Q_onAssert(char const *module, int loc) {
    /*
    * NOTE: add here your application-specific error handling
    */
    (void)module;
    (void)loc;
    QS_ASSERTION(module, loc, (uint32_t)10000U); /* report assertion to QS */

#ifndef NDEBUG
    /* light up all LEDs */
    GPIOF->DATA_Bits[LED_GREEN | LED_RED | LED_BLUE] = 0xFFU;
    /* for debugging, hang on in an endless loop toggling the RED LED... */
    while (GPIOF->DATA_Bits[BTN_SW1] != 0) {
        GPIOF->DATA = LED_RED;
        GPIOF->DATA = 0U;
    }
#endif

    NVIC_SystemReset();
}

/* QS callbacks ============================================================*/
#ifdef Q_SPY
/*..........................................................................*/
uint8_t QS_onStartup(void const *arg) {
    static uint8_t qsTxBuf[2 * 1024]; /* buffer for QS-TX channel */
    static uint8_t qsRxBuf[100];      /* buffer for QS-RX channel */
    uint32_t tmp;

    QS_initBuf(qsTxBuf, sizeof(qsTxBuf));
    QS_rxInitBuf(qsRxBuf, sizeof(qsRxBuf));

    /* enable clock for UART0 and GPIOA (used by UART0 pins) */
    SYSCTL->RCGCUART |= (1U << 0); /* enable Run mode for UART0 */
    SYSCTL->RCGCGPIO |= (1U << 0); /* enable Run mode for GPIOA */

    /* configure UART0 pins for UART operation */
    tmp = (1U << 0) | (1U << 1);
    GPIOA->DIR &= ~tmp;
    GPIOA->SLR &= ~tmp;
    GPIOA->ODR &= ~tmp;
    GPIOA->PUR &= ~tmp;
    GPIOA->PDR &= ~tmp;
    GPIOA->AMSEL &= ~tmp; /* disable analog function on the pins */
    GPIOA->AFSEL |= tmp;  /* enable ALT function on the pins */
    GPIOA->DEN |= tmp;    /* enable digital I/O on the pins */
    GPIOA->PCTL &= ~0x00U;
    GPIOA->PCTL |= 0x11U;

    /* configure the UART for the desired baud rate, 8-N-1 operation */
    tmp = (((SystemCoreClock * 8U) / UART_BAUD_RATE) + 1U) / 2U;
    UART0->IBRD = tmp / 64U;
    UART0->FBRD = tmp % 64U;
    UART0->LCRH = (0x3U << 5);  /* configure 8-N-1 operation */
    UART0->LCRH |= (0x1U << 4); /* enable FIFOs */
    UART0->CTL = (1U << 0)      /* UART enable */
                 | (1U << 8)    /* UART TX enable */
                 | (1U << 9);   /* UART RX enable */

    /* configure UART interrupts (for the RX channel) */
    UART0->IM |= (1U << 4) | (1U << 6); /* enable RX and RX-TO interrupt */
    UART0->IFLS |= (0x2U << 2);         /* interrupt on RX FIFO half-full */
    /* NOTE: do not enable the UART0 interrupt yet. Wait till QF_onStartup() */

    QS_tickPeriod_ = SystemCoreClock / BSP_TICKS_PER_SEC;
    QS_tickTime_ = QS_tickPeriod_; /* to start the timestamp at zero */

