1066mutex/QP_keil_based_tm4c123/bsp.c
    /* setup the QS filters... */
    QS_FILTER_ON(QS_SM_RECORDS); /* state machine records */
    QS_FILTER_ON(QS_UA_RECORDS); /* all usedr records */
    //QS_FILTER_ON(QS_MUTEX_LOCK);
    //QS_FILTER_ON(QS_MUTEX_UNLOCK);

    return (uint8_t)1; /* return success */
}
/*..........................................................................*/
void QS_onCleanup(void) {
}
/*..........................................................................*/
QSTimeCtr QS_onGetTime(void) {                               /* NOTE: invoked with interrupts DISABLED */
    if ((SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk) == 0) { /* not set? */
        return QS_tickTime_ - (QSTimeCtr)SysTick->VAL;
    } else { /* the rollover occured, but the SysTick_ISR did not run yet */
        return QS_tickTime_ + QS_tickPeriod_ - (QSTimeCtr)SysTick->VAL;
    }
}
/*..........................................................................*/
void QS_onFlush(void) {
    uint16_t fifo = UART_TXFIFO_DEPTH; /* Tx FIFO depth */
    uint8_t const *block;
    while ((block = QS_getBlock(&fifo)) != (uint8_t *)0) {
        /* busy-wait as long as TX FIFO has data to transmit */
        while ((UART0->FR & UART_FR_TXFE) == 0) {
        }

        while (fifo-- != 0U) {    /* any bytes in the block? */
            UART0->DR = *block++; /* put into the TX FIFO */
        }
        fifo = UART_TXFIFO_DEPTH; /* re-load the Tx FIFO depth */
    }
}
/*..........................................................................*/
/*! callback function to reset the target (to be implemented in the BSP) */
void QS_onReset(void) {
    NVIC_SystemReset();
}
/*..........................................................................*/
/*! callback function to execute a user command (to be implemented in BSP) */
void QS_onCommand(uint8_t cmdId,
                  uint32_t param1, uint32_t param2, uint32_t param3) {
    (void)cmdId;
    (void)param1;
    (void)param2;
    (void)param3;

    /* application-specific record */
    QS_BEGIN(COMMAND_STAT, (void *)1)
    QS_U8(2, cmdId);
    QS_U32(8, param1);
    QS_U32(8, param2);
    QS_U32(8, param3);
    QS_END()

    if (cmdId == 10U) {
        Q_ERROR(); /* for testing of assertion failure */
    } else if (cmdId == 11U) {
        assert_failed("QS_onCommand", 123);
    }
}

#endif /* Q_SPY */
/*--------------------------------------------------------------------------*/

/*****************************************************************************
* NOTE1:
* The configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY constant from the
* FreeRTOS configuration file specifies the highest ISR priority that
* is disabled by the QF framework. The value is suitable for the
* NVIC_SetPriority() CMSIS function.
*
* Only ISRs prioritized at or below the
* configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY level (i.e.,
* with the numerical values of priorities equal or higher than
* configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY) are allowed to call any
* QP/FreeRTOS services. These ISRs are "kernel-aware".
*
* Conversely, any ISRs prioritized above the
* configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY priority level (i.e., with
* the numerical values of priorities less than
* configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY) are never disabled and are
* not aware of the kernel. Such "kernel-unaware" ISRs cannot call any
* QP/FreeRTOS services. The only mechanism by which a "kernel-unaware" ISR
* can communicate with the QF framework is by triggering a "kernel-aware"
* ISR, which can post/publish events.
*
* For more information, see article "Running the RTOS on a ARM Cortex-M Core"
* http://www.freertos.org/RTOS-Cortex-M3-M4.html
*
* NOTE2:
* The User LED is used to visualize the idle loop activity. The brightness
* of the LED is proportional to the frequency of invcations of the idle loop.
* Please note that the LED is toggled with interrupts locked, so no interrupt
* execution time contributes to the brightness of the User LED.
*/

/* BSP_booster_pack interface functions #####################################################*/

/* TODO: bst_pack initialisation


Accelerometer----------------------------
PD2-0 input analogue.
ADC init() //!ADC0 

Microphone-------------------------------
PE5 input analogue.
NOTE: //!ADC0**

joystic----------------------------------
PE4 input analogue
PD3 input analogue
PB5 input analogue 
NOTE: //!ADC0**

Buttons---------------------------------
USER BUTTON 1    PD6 INPUT.
USER BUTTON 2    PD7 INPUT.
JOYSTIC BUTTON 3 PE4 INPUT.

Display---------------------------------
PA4  SPI CS.
PF4  SPI DC. 
PF0  SPI RESET. 


ADC FOR MIC             (J1.6/PE5/AIN8)
ADC FOR JOYSTIC       X (J1.2/PB5/AIN11) and Y (J3.26/PD3/AIN4)
ADC FOR ACCELEROMETER X (J3.23/PD0/AIN7), Y (J3.24/PD1/AIN6), and Z (J3.25/PD2/AIN5)
 */

/* TODO: INPUT/OUTPUT functions
joystic input() 
get inputs from the joystick ADC. can use polling or interrupts


RGB set colour()
set pin pwm
toggle pwm LED (change the pwm value)
toggle digital LED

Buzzer set().

Accelerometer input().
Microphone input().

Display()

write command 8bit
write data 8bit

 */

// ------------BSP_Buzzer_Init------------
// Initialize the GPIO and PWM or timer modules which
// correspond with BoosterPack pin J4.40.  The
// frequency is 2048 Hz, and the duty cycle is
// represented as a 10-bit number.
// Input: duty is 10-bit duty cycle for the buzzer
// Output: none
//TODO: FIX COMMENTS. make it a void void ()
/**Initialise boosterpack buzzer I/O
 * Buzzer is connected to PF2. 
 * Timer1A is used for the buzzer 
 */
static uint32_t PWM_sysclk;  // pwm module clock frequency
void BSP_BP_BuzzerIO_Init(uint16_t duty) {
    if (duty > 1023) {
        return;  // invalid input
    }
    // ***************** Timer1A initialization *****************
    SYSCTL->RCGCGPIO |= 0x0020;  // !activate clock for Port F DONE
    while ((SYSCTL->PRGPIO & 0x20) == 0) {
    };                     // allow time for clock to stabilize
    GPIOF->AFSEL |= 0x04;  // enable alt funct on PF2
    GPIOF->DEN |= 0x04;    // enable digital I/O on PF2
                           // configure PF2 as PWM
    GPIOF->PCTL = (GPIOF->PCTL & 0xFFFFF0FF) + 0x00000500;
    GPIOF->AMSEL &= ~0x04;  // disable analog functionality on PF2

