1066mutex/QP_keil_based_tm4c123/bsp.c
// ------------BSP_Delay1ms------------
// Simple delay function which delays about n
// milliseconds.
// Inputs: n  number of 1 msec to wait
// Outputs: none
// Note: this is based on a 80Mhz sysClk
void BSP_Delay1ms(uint32_t n) {
    while (n) {
        parrotdelay(23746);  // 1 msec, tuned at 80 MHz, originally part of LCD module
        n--;
    }
}

// Initialization SPI interface for BP TFT display.
void BSP_BP_SPI_TFT_Init(void) {
    // toggle RST low to reset; CS low so it'll listen to us
    // SSI2Fss is not available, so use GPIO on PA4
    SYSCTL->RCGCGPIO |= 0x00000023;  // 1) activate clock for Ports F, B, and A
    while ((SYSCTL->PRGPIO & 0x23) != 0x23) {
    };                                   // allow time for clocks to stabilize
    BP_LCD_RST_PORT->LOCK = 0x4C4F434B;  // 2a) unlock GPIO Port F
    BP_LCD_RST_PORT->CR = 0x1F;          // allow changes to PF4-0
                                         // 2b) no need to unlock PF4, PB7, PB4, or PA4
    BP_LCD_RST_PORT->AMSEL &= ~0x11;     // 3a) disable analog on PF4,0
    BP_SPI_DATA_PORT->AMSEL &= ~0x90;    // 3b) disable analog on PB7,4
    BP_SPI_CS_PORT->AMSEL &= ~0x10;      // 3c) disable analog on PA4
                                         // 4a) configure PF4,0 as GPIO
    BP_LCD_RST_PORT->PCTL = (BP_LCD_RST_PORT->PCTL & 0xFFF0FFF0) + 0x00000000;
    // 4b) configure PB7,4 as SSI
    BP_SPI_DATA_PORT->PCTL = (BP_SPI_DATA_PORT->PCTL & 0x0FF0FFFF) + 0x20020000;
    // 4c) configure PA4 as GPIO
    BP_SPI_CS_PORT->PCTL = (BP_SPI_CS_PORT->PCTL & 0xFFF0FFFF) + 0x00000000;
    BP_LCD_RST_PORT->DIR |= 0x11;     // 5a) make PF4,0 output
    BP_SPI_CS_PORT->DIR |= 0x10;      // 5b) make PA4 output
    BP_LCD_RST_PORT->AFSEL &= ~0x11;  // 6a) disable alt funct on PF4,0
    BP_SPI_DATA_PORT->AFSEL |= 0x90;  // 6b) enable alt funct on PB7,4
    BP_SPI_CS_PORT->AFSEL &= ~0x10;   // 6c) disable alt funct on PA4
    BP_LCD_RST_PORT->DEN |= 0x11;     // 7a) enable digital I/O on PF4,0
    BP_SPI_DATA_PORT->DEN |= 0x90;    // 7b) enable digital I/O on PB7,4
    BP_SPI_CS_PORT->DEN |= 0x10;      // 7c) enable digital I/O on PA4

    // reset display
    BSP_BP_TFT_CS_LOW();
    BSP_BP_TFT_RESET_HIGH();
    BSP_Delay1ms(50);
    BSP_BP_TFT_RESET_LOW();
    BSP_Delay1ms(50);
    BSP_BP_TFT_RESET_HIGH();
    BSP_Delay1ms(50);
    BSP_BP_TFT_CS_HIGH();

    // activate clock for SSI2
    SYSCTL->RCGCSSI |= 0x00000004;
    // allow time for clock to stabilize
    while ((SYSCTL->PRSSI & 0x00000004) == 0) {
    };
    SSI2->CR1 &= ~0x00000002;  // disable SSI
    SSI2->CR1 &= ~0x00000004;  // master mode
                               // configure for clock from source PIOSC for baud clock source
    SSI2->CC = (SSI2->CC & ~0x0000000F) + 0x00000005;
    // clock divider for 4 MHz SSIClk (16 MHz PIOSC/4)
    // PIOSC/(CPSDVSR*(1+SCR))
    // 16/(4*(1+0)) = 4 MHz
    SSI2->CPSR = (SSI2->CPSR & ~0x000000FF) + 4;  // must be even number
    SSI2->CR0 &= ~(0x0000FF00 |                   // SCR = 0 (4 Mbps data rate)
                   0x00000080 |                   // SPH = 0
                   0x00000040);                   // SPO = 0
                                                  // FRF = Freescale format
    SSI2->CR0 = (SSI2->CR0 & ~0x00000030) + 0x00000000;
    // DSS = 8-bit data
    SSI2->CR0 = (SSI2->CR0 & ~0x0000000F) + 0x00000007;
    SSI2->CR1 |= 0x00000002;  // enable SSI
}

// END LCD display functions===================================================//
//

// ADC0 initialisation==========================================================//
// There are six analog inputs on the Educational BoosterPack MKII:
// microphone (J1.6/PE5/AIN8)
// joystick X (J1.2/PB5/AIN11) and Y (J3.26/PD3/AIN4)
// accelerometer X (J3.23/PD0/AIN7), Y (J3.24/PD1/AIN6), and Z (J3.25/PD2/AIN5)
// All six initialization functions can use this general ADC
// initialization.  The joystick uses sample sequencer 1,
// the accelerometer sample sequencer 2, and the microphone
// uses sample sequencer 3.
static void adcinit0(void) {
    SYSCTL->RCGCADC |= 0x00000001;  // 1) activate ADC0
    while ((SYSCTL->PRADC & 0x01) == 0) {
    };                     // 2) allow time for clock to stabilize
                           // 3-7) GPIO initialization in more specific functions
    ADC0->PC &= ~0xF;      // 8) clear max sample rate field
    ADC0->PC |= 0x2;       //    configure for 125K samples/sec ** see data sheet
    ADC0->SSPRI = 0x3210;  // 9) Sequencer 3 is lowest priority
                           // 10-15) sample sequencer initialization in more specific functions
}
// ADC1 initialisation==========================================================//
// analog input for microphone (J1.6/PE5/AIN8) on the Educational BoosterPack MKII:
// microphone uses sample sequencer 3.
static void l_adcinit1(void) {
    SYSCTL->RCGCADC |= 0x00000002;  // 1) activate ADC1
    while ((SYSCTL->PRADC & 0x02) == 0) {
    };                     // 2) allow time for clock to stabilize
                           // 3-7) GPIO initialization in more specific functions
    ADC1->PC &= ~0xF;      // 8) clear max sample rate field
    ADC1->PC |= 0x3;       //    configure for 250K samples/sec ** see data sheet
    ADC1->SSPRI = 0x3210;  // 9) Sequencer 3 is lowest priority
                           // 10-15) sample sequencer initialization in more specific functions
}

// BSP Booster pack Joystick functions======================================
//
void BSP_BP_Joystick_Init(void) {
    /* enable Run mode for GPIOE, GPIOB, GPIOD */
    SYSCTL->RCGCGPIO |= PORTE | PORTB | PORTD;
    /* booster pack User Switches initialization */

    BSP_BP_JST_BTN_PORT->DIR &= ~(BSP_BP_JST_BTN_PIN); /*  set direction: input */

    ROM_GPIOPadConfigSet(GPIOE_BASE, (BSP_BP_JST_BTN_PIN),
                         GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD_WPU);

    BSP_BP_ADC_Y_PORT->AMSEL |= 0x08;  // 3b) enable analog on PD3
    BSP_BP_ADC_X_PORT->AMSEL |= 0x20;  // 3c) enable analog on PB5

    BSP_BP_ADC_Y_PORT->DIR &= ~0x08;  // 5b) make PD3 input
    BSP_BP_ADC_X_PORT->DIR &= ~0x20;  // 5c) make PB5 input

    BSP_BP_ADC_Y_PORT->AFSEL |= 0x08;  // 6b) enable alt funct on PD3
    BSP_BP_ADC_X_PORT->AFSEL |= 0x20;  // 6c) enable alt funct on PB5
    BSP_BP_ADC_Y_PORT->DEN &= ~0x08;   // 7b) enable analog functionality on PD3
    BSP_BP_ADC_X_PORT->DEN &= ~0x20;   // 7c) enable analog functionality on PB5

    adcinit0();  // 8-9) general ADC initialization

    ADC0->ACTSS &= ~0x0002;  // 10) disable sample sequencer 1
    ADC0->EMUX &= ~0x00F0;   // 11) seq1 is software trigger
    ADC0->SSMUX1 = 0x004B;   // 12) set channels for SS1
    ADC0->SSCTL1 = 0x0060;   // 13) no TS0 D0 IE0 END0 TS1 D1, yes IE1 END1
    ADC0->IM &= ~0x0002;     // 14) disable SS1 interrupts
    ADC0->ACTSS |= 0x0002;   // 15) enable sample sequencer 1
}

// ------------BSP_Joystick_Input------------
// Read and return the immediate status of the
// joystick.  Button de-bouncing for the Select
// button is not considered.  The joystick X- and
// Y-positions are returned as 10-bit numbers,
// even if the ADC on the LaunchPad is more precise.
// Input: x is pointer to store X-position (0 to 1023)
//        y is pointer to store Y-position (0 to 1023)
//        select is pointer to store Select status (0 if pressed)
// Output: none
// Assumes: BSP_Joystick_Init() has been called
// TODO: clean up the blocking while loop.
void BSP_Joystick_Input(uint16_t *x, uint16_t *y) {
    // ADC0->PSSI = 0x0002;  // 1) initiate SS1
    // while ((ADC0->RIS & 0x02) == 0) {
    // };                         // 2) wait for conversion done

    // static uint32_t adcLPS = 0; // low pass filtered ADC reading
    // static uint32_t joystickX = 0; // last joystick x position
    // static uint32_t joystickY = 0; // last joystick y position
    // unsigned long tmp;
    /* 1st order low-pass filter: time constant ~= 2^n samples
        * TF = (1/2^n)/(z-((2^n - 1)/2^n)),
        * e.g., n=3, y(k+1) = y(k) - y(k)/8 + x(k)/8 => y += (x - y)/8
        */

    *x = ADC0->SSFIFO1 >> 2;  // read first result

    *y = ADC0->SSFIFO1 >> 2;  // 3b) read second result
    ADC0->ISC = 0x0002;       // 4) acknowledge completion
}

// trigger joystick ADC
void BSP_Joystick_Trigger(void) {
    ADC0->PSSI |= (1 << 1); /* Enable SS2 conversion or start sampling data from AN0 */
}

// ADC initialization for onboard temp sensor.
// Using intrrupt mode.
static void mcuTempSensorInit(void) {
    SYSCTL->RCGCADC |= 1; /* enable clock to ADC0 */
    /* initialize ADC0 */
    ADC0->ACTSS &= ~8;         /* disable SS3 during configuration */
    ADC0->EMUX &= ~0xF000;     /* software trigger conversion seq 0 */
    ADC0->SSMUX3 = 0x0008;     /* get input from channel 0 */
    ADC0->SSCTL3 |= 0x0E;      /* take chip temperature, set flag at 1st sample */
    ADC0->IM |= 0x0008;        //  enable SS3 interrupts
    ADC0->ACTSS |= (1U << 3);  //  enable sample sequencer 3
}
// TODO place in the isr section above.
void ADC1Seq3_IRQHandler(void) {
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;

