1066mutex/QP_keil_based_tm4c123/bsp.c
    ADC1->ISC |= (1U << 3);  // clear interrupt flag

    TempEvt *reading = Q_NEW_FROM_ISR(TempEvt, NEW_TEMP_DATA_SIG);
    // read adc coversion result from SS3 FIFO and convert to °C using
    // Temp = 147.5 – ((75 × Vref(+) – Vref(–)) × ADC_output)) / 4096. tm4c vref == 3.3v
    //
    // reading->temp = 147 - ((247 * ADC0->SSFIFO3) / 4096);
    reading->temp = (ADC1->SSFIFO3 >> 2);
    QACTIVE_POST_FROM_ISR(AO_Heartbeat,
                          (QEvt *)reading,
                          &xHigherPriorityTaskWoken,
                          &ADCSeq3_IRQHandler);

    /* the usual end of FreeRTOS ISR... */
    portEND_SWITCHING_ISR(xHigherPriorityTaskWoken);
}

// trigger the ADC to sample the MCU temperature sensor.
void BSP_SystemTempGet(void) {
    ADC0->PSSI |= (1 << 3); /* Enable SS3 conversion or start sampling data from AN0 */
}

// ------------BSP_Accelerometer_Init------------
// Initialize three ADC pins, which correspond with
// BoosterPack pins J3.23 (X) (PD0/AIN7), J3.24 (Y) (PD1/AIN6), and
// J3.25 (Y) (PD2/AIN5).
// Input: none
// Output: none
void BSP_Accelerometer_Init(void) {
    adcinit0();
    SYSCTL->RCGCGPIO |= 0x00000008;  // 1) activate clock for Port D
    while ((SYSCTL->PRGPIO & 0x08) == 0) {
    };                       // allow time for clock to stabilize
                             // 2) no need to unlock PD2-0
    GPIOD->AMSEL |= 0x07;    // 3) enable analog on PD2-0
                             // 4) configure PD2-0 as ?? (skip this line because PCTL is for digital only)
    GPIOD->DIR &= ~0x07;     // 5) make PD2-0 input
    GPIOD->AFSEL |= 0x07;    // 6) enable alt funct on PD2-0
    GPIOD->DEN &= ~0x07;     // 7) enable analog functionality on PD2-0
    adcinit0();              // 8-9) general ADC initialization
    ADC0->ACTSS &= ~0x0004;  // 10) disable sample sequencer 2
    ADC0->EMUX &= ~0x0F00;   // 11) seq2 is software trigger
    ADC0->SSMUX2 = 0x0567;   // 12) set channels for SS2
    ADC0->SSCTL2 = 0x0600;   // 13) no D0 END0 IE0 TS0 D1 END1 IE1 TS1 D2 TS2, yes IE2 END2
    ADC0->IM &= ~0x0004;     // 14) disable SS2 interrupts
    ADC0->ACTSS |= 0x0004;   // 15) enable sample sequencer 2
}

// ------------BSP_Accelerometer_Input------------
// Read and return the immediate status of the
// accelerometer.  The accelerometer X-, Y-, and
// Z-measurements are returned as 10-bit numbers,
// even if the ADC on the LaunchPad is more precise.
// Input: x is pointer to store X-measurement (0 to 1023)
//        y is pointer to store Y-measurement (0 to 1023)
//        z is pointer to store Z-measurement (0 to 1023)
// Output: none
// Assumes: BSP_Accelerometer_Init() has been called
// TODO: remove blocking while loop.
void BSP_Accelerometer_Input(uint16_t *x, uint16_t *y, uint16_t *z) {
    // ADC0->PSSI = 0x0004;  // 1) initiate SS2
    // // TODO: add while loop timeout
    // while ((ADC0->RIS & 0x04) == 0) {};// 2) wait for conversion done
    //! SSFIFO2 >> 2 as result is a 10-bit value and fifo data is 12-bits
    *x = ADC0->SSFIFO2 >> 2;  // 3a) read first result
    *y = ADC0->SSFIFO2 >> 2;  // 3b) read second result
    *z = ADC0->SSFIFO2 >> 2;  // 3c) read third result
    ADC0->ISC = 0x0004;       // 4) acknowledge completion
}

// trigger the ADC to sample the Accelerometer sensor.
void BSP_AccelerometerGet(void) {
    ADC0->PSSI |= (1 << 2);  // initiate SS2
}

// TODO: isr for accelerometer ADC

// TODO: use the ADC1 for the microphone. can set higher sample rate. change ADC0 to ADC1.
//       isr for microphone

// ------------BSP_Microphone_Init------------
// Initialize one ADC pin, which corresponds with
// BoosterPack pin J1.6. tm4c123 pin PE5.
// Input: none
// Output: none
void BSP_Microphone_Init(void) {
    l_adcinit1();
    SYSCTL->RCGCGPIO |= 0x00000010;  // 1) activate clock for Port E
    while ((SYSCTL->PRGPIO & 0x10) == 0) {
    };                       // allow time for clock to stabilize
                             // 2) no need to unlock PE5
    GPIOE->AMSEL |= 0x20;    // 3) enable analog on PE5
                             // 4) configure PE5 as ?? (skip this line because PCTL is for digital only)
    GPIOE->DIR &= ~0x20;     // 5) make PE5 input
    GPIOE->AFSEL |= 0x20;    // 6) enable alt funct on PE5
    GPIOE->DEN &= ~0x20;     // 7) enable analog functionality on PE5
    l_adcinit1();            // 8-9) general ADC initialization
    ADC1->ACTSS &= ~0x0008;  // 10) disable sample sequencer 3
    ADC1->EMUX &= ~0xF000;   // 11) seq3 is software trigger
    ADC1->SSMUX3 = 0x0008;   // 12) set channels for SS3
    ADC1->SSCTL3 = 0x0006;   // 13) no D0 TS0, yes IE0 END0
    ADC1->SAC |= 0x2;        // 14) 4x hardware oversampling
    ADC1->PP |= 0x00300000;  // 14) Resolution 12-bit
    ADC1->IM |= 0x0008;      // 15) enable SS3 interrupts
    ADC1->ACTSS |= 0x0008;   // 16) enable sample sequencer 3
}

// ------------BSP_Microphone_Input------------
// Read and return the immediate status of the
// microphone.  The sound measurement is returned
// as a 10-bit number, even if the ADC on the
// LaunchPad is more precise.
// Input: mic is pointer to store sound measurement (0 to 1023)
// Output: none
// Assumes: BSP_Microphone_Init() has been called
void BSP_Microphone_Input(uint16_t *mic) {
    // ADC0->PSSI = 0x0008;  // 1) initiate SS3
    // while ((ADC0->RIS & 0x08) == 0) {
    // };                           // 2) wait for conversion done
    *mic = ADC1->SSFIFO3 >> 2;  // 3) read result
    ADC1->ISC = 0x0008;         // 4) acknowledge completion
}

// trigger the ADC to sample the mic input.
void BSP_Microphone_Get(void) {
    ADC1->PSSI = 0x0008;  // 1) initiate SS3
}

// I2C initialization==============================================

// There are two I2C devices on the Educational BoosterPack MKII:
// OPT3001 Light Sensor
// !TMP006 Temperature sensor not populated.
// Both initialization functions can use this general I2C
// initialization.
#define MAXRETRIES 5  // number of receive attempts before giving up
void static i2cinit(void) {
    SYSCTL->RCGCI2C |= 0x0002;              // 1a) activate clock for I2C1
    SYSCTL->RCGCGPIO |= PORTA;              // 1b) activate clock for Port A
    while ((SYSCTL->PRGPIO & 0x01) == 0) {  // TODO: add while loop timeout
    };                                      // allow time for clock to stabilize
                                            // 2) no need to unlock PA7-6
    GPIOA->AMSEL &= ~0xC0;                  // 3) disable analog functionality on PA7-6
                                            // 4) configure PA7-6 as I2C1
    GPIOA->PCTL = (GPIOA->PCTL & 0x00FFFFFF) + 0x33000000;
    GPIOA->ODR |= 0x80;      // 5) enable open drain on PA7 only
    GPIOA->AFSEL |= 0xC0;    // 6) enable alt funct on PA7-6
    GPIOA->DEN |= 0xC0;      // 7) enable digital I/O on PA7-6
    I2C1->MCR = 0x00000010;  // 8) master function enable
    I2C1->MTPR = 39;         // 9) configure for 100 kbps clock
                             // 20*(TPR+1)*12.5ns = 10us, with TPR=39
}

static void L_waitTillReady(void) {
    while (I2C1->MCS & I2C_MCS_BUSY) {  // TODO: add while loop timeout
    };
}
// receives two bytes from specified slave
// Note for HMC6352 compass only:
// Used with 'A' commands
// Note for TMP102 thermometer only:
// Used to read the contents of the pointer register
uint16_t BSP_I2C_Recv2(int8_t slave) {
    uint8_t data1, data2;
    int retryCounter = 1;
    do {
        L_waitTillReady();                // wait for I2C ready
        I2C1->MSA = (slave << 1) & 0xFE;  // MSA[7:1] is slave address
        I2C1->MSA |= 0x01;                // MSA[0] is 1 for receive

        I2C1->MCS = (I2C_MCS_ACK      // positive data ack
                                      //& ~I2C_MCS_STOP    // no stop
                     | I2C_MCS_START  // generate start/restart
                     | I2C_MCS_RUN);  // master enable
        L_waitTillReady();            // wait for transmission done
        data1 = (I2C1->MDR & 0xFF);   // MSB data sent first

