1066mutex/QP_keil_based_tm4c123/bsp.c
#define UART_FR_TXFE 0x00000080      // UART Transmit FIFO Empty
#define UART_FR_RXFF 0x00000040      // UART Receive FIFO Full
#define UART_FR_TXFF 0x00000020      // UART Transmit FIFO Full
#define UART_FR_RXFE 0x00000010      // UART Receive FIFO Empty
#define UART_FR_BUSY 0x00000008      // UART Transmit Busy
#define UART_LCRH_WLEN_8 0x00000060  // 8 bit word length
#define UART_LCRH_FEN 0x00000010     // UART Enable FIFOs
#define UART_CTL_UARTEN 0x00000001   // UART Enable
#define UART_IFLS_RX1_8 0x00000000   // RX FIFO >= 1/8 full
#define UART_IFLS_TX1_8 0x00000000   // TX FIFO <= 1/8 full
#define UART_IM_RTIM 0x00000040      // UART Receive Time-Out Interrupt \
                                                    // Mask
#define UART_IM_TXIM 0x00000020      // UART Transmit Interrupt Mask
#define UART_IM_RXIM 0x00000010      // UART Receive Interrupt Mask
#define UART_RIS_RTRIS 0x00000040    // UART Receive Time-Out Raw \
                                                    // Interrupt Status
#define UART_RIS_TXRIS 0x00000020    // UART Transmit Raw Interrupt \
                                                    // Status
#define UART_RIS_RXRIS 0x00000010    // UART Receive Raw Interrupt \
                                                    // Status
#define UART_ICR_RTIC 0x00000040     // Receive Time-Out Interrupt Clear
#define UART_ICR_TXIC 0x00000020     // Transmit Interrupt Clear
#define UART_ICR_RXIC 0x00000010     // Receive Interrupt Clear

//------------UART1_Init------------
// Initialize the UART1 for 115,200 baud rate (assuming 50 MHz clock),
// 8 bit word length, no parity bits, one stop bit, FIFOs enabled
// Input: none
// Output: none
void UART1_Init(void) {
    SYSCTL->RCGCUART |= 0x02;        // activate UART1
    SYSCTL->RCGCGPIO |= 0x02;        // activate port B
    RxFifo_Init();                   // initialize empty FIFO
    UART1->CTL &= ~UART_CTL_UARTEN;  // disable UART
    UART1->IBRD = 325;               // IBRD = int(50,000,000 / (16 * 115200)) = int(27.126736) (interger part)
    UART1->FBRD = 33;                // FBRD = round(0.126736 * 64) = 26 (fractional part)
                                     // 8 bit word length (no parity bits, one stop bit, FIFOs)
    UART1->LCRH = (UART_LCRH_WLEN_8 | UART_LCRH_FEN);
    UART1->IFLS &= ~0x3F;  // clear TX and RX interrupt FIFO level fields
                           // configure interrupt for TX FIFO <= 1/8 full
                           // configure interrupt for RX FIFO >= 1/8 full
    UART1->IFLS += (UART_IFLS_TX1_8 | UART_IFLS_RX1_8);
    // enable RX FIFO interrupts and RX time-out interrupt
    UART1->IM |= (UART_IM_RXIM | UART_IM_RTIM);
    UART1->CTL |= 0x301;   // enable UART
    GPIOB->AFSEL |= 0x03;  // enable alt funct on PB1-0
    GPIOB->DEN |= 0x03;    // enable digital I/O on PB1-0
                           // configure PB1-0 as UART
    GPIOB->PCTL = (GPIOB->PCTL & 0xFFFFFF00) + 0x00000011;
    GPIOB->AMSEL &= ~0x03;  // disable analog functionality on PB
}
// copy from hardware RX FIFO to software RX FIFO
// stop when hardware RX FIFO is empty or software RX FIFO is full
void static copyHardwareToSoftware(void) {
    uint8_t letter;
    while (((UART1->FR & UART_FR_RXFE) == 0) && (UART1_InStatus() < (FIFOSIZE - 1))) {
        letter = UART1->DR;
        RxFifo_Put(letter);
    }
}

// input ASCII character from UART
// spin if RxFifo is empty
uint8_t UART1_InChar(void) {
    uint8_t letter;
    while (RxFifo_Get(&letter) == FIFOFAIL) {
    };
    return (letter);
}
//------------UART1_OutChar------------
// Output 8-bit to serial port
// Input: letter is an 8-bit ASCII character to be transferred
// Output: none
void UART1_OutChar(uint8_t data) {
    while ((UART1->FR & UART_FR_TXFF) != 0)
        ;
    UART1->DR = data;
}
// at least one of two things has happened:
// hardware RX FIFO goes from 1 to 2 or more items
// UART receiver has timed out
// void UART1_Handler(void) {
//     if (UART1->RIS & UART_RIS_RXRIS) {  // hardware RX FIFO >= 2 items
//         UART1->ICR = UART_ICR_RXIC;     // acknowledge RX FIFO
//         // copy from hardware RX FIFO to software RX FIFO
//         copyHardwareToSoftware();
//     }
//     if (UART1->RIS & UART_RIS_RTRIS) {  // receiver timed out
//         UART1->ICR = UART_ICR_RTIC;     // acknowledge receiver time out
//         // copy from hardware RX FIFO to software RX FIFO
//         copyHardwareToSoftware();
//     }
// }

//------------UART1_OutString------------
// Output String (NULL termination)
// Input: pointer to a NULL-terminated string to be transferred
// Output: none
void UART1_OutString(uint8_t *pt) {
    while (*pt) {
        UART1_OutChar(*pt);
        pt++;
    }
}

//-----------------------UART1_OutUDec-----------------------
// Output a 32-bit number in unsigned decimal format
// Input: 32-bit number to be transferred
// Output: none
// Variable format 1-10 digits with no space before or after
void UART1_OutUDec(uint32_t n) {
    // This function uses recursion to convert decimal number
    //   of unspecified length as an ASCII string
    if (n >= 10) {
        UART1_OutUDec(n / 10);
        n = n % 10;
    }
    UART1_OutChar(n + '0'); /* n is between 0 and 9 */
}

//------------UART1_FinishOutput------------
// Wait for all transmission to finish
// Input: none
// Output: none
void UART1_FinishOutput(void) {
    // Wait for entire tx message to be sent
    // UART Transmit FIFO Empty =1, when Tx done
    while ((UART1->FR & UART_FR_TXFE) == 0)
        ;
    // wait until not busy
    while ((UART1->FR & UART_FR_BUSY))
        ;
}

//! Uart0 for testing --------------------------------

//------------UART0_Init------------
// Initialize the UART for 115,200 baud rate (assuming 80 MHz UART clock),
// 8 bit word length, no parity bits, one stop bit, FIFOs enabled
// Input: none
// Output: none
void UART0_Init(void) {
    SYSCTL->RCGCUART |= 0x01;  // activate UART0
    SYSCTL->RCGCGPIO |= 0x01;  // activate port A
    while ((SYSCTL->PRGPIO & 0x01) == 0) {
    };
    UART0->CTL &= ~UART_CTL_UARTEN;  // disable UART
    UART0->IBRD = 325;               // IBRD = int(80,000,000 / (16 * 115200)) = int(43.402778)
    UART0->FBRD = 33;                // FBRD = round(0.402778 * 64) = 26
                                     // 8 bit word length (no parity bits, one stop bit, FIFOs)
    UART0->LCRH = (UART_LCRH_WLEN_8 | UART_LCRH_FEN);

    UART0->IFLS &= ~0x3F;  // clear TX and RX interrupt FIFO level fields
                           // configure interrupt for TX FIFO <= 1/8 full
                           // configure interrupt for RX FIFO >= 1/8 full
    UART0->IFLS += (UART_IFLS_TX1_8 | UART_IFLS_RX1_8);
    // enable RX FIFO interrupts and RX time-out interrupt
    UART0->IM |= (UART_IM_RXIM | UART_IM_RTIM);
    UART0->CTL |= 0x301;   // enable UART
    GPIOA->AFSEL |= 0x03;  // enable alt funct on PA1-0
    GPIOA->DEN |= 0x03;    // enable digital I/O on PA1-0
                           // configure PA1-0 as UART
    GPIOA->PCTL = (GPIOA->PCTL & 0xFFFFFF00) + 0x00000011;
    GPIOA->AMSEL &= ~0x03;  // disable analog functionality on PA
}

//------------UART0_InChar------------
// Wait for new serial port input
// Input: none
// Output: ASCII code for key typed
char UART0_InChar(void) {
    while ((UART0->FR & UART_FR_RXFE) != 0)
        ;
    // mask as it is a 32bit reg only need lower 8bits
    return ((char)(UART0->DR & 0xFF));  // type cast to char.
}
//------------UART0_OutChar------------
// Output 8-bit to serial port
// Input: letter is an 8-bit ASCII character to be transferred
// Output: none
void UART0_OutChar(char data) {
    while ((UART0->FR & UART_FR_TXFF) != 0)
        ;
    UART0->DR = data;
}

//------------UART0_OutString------------
// Output String (NULL termination)
// Input: pointer to a NULL-terminated string to be transferred
// Output: none
void UART0_OutString(char *pt) {
    while (*pt) {
        UART0_OutChar(*pt);
        pt++;
    }
}

//------------UART0_InUDec------------
// InUDec accepts ASCII input in unsigned decimal format
//     and converts to a 32-bit unsigned number
//     valid range is 0 to 4294967295 (2^32-1)
// Input: none
// Output: 32-bit unsigned number
// If you enter a number above 4294967295, it will return an incorrect value
// Backspace will remove last digit typed
uint32_t UART0_InUDec(void) {
    uint32_t number = 0, length = 0;
    char character;
    character = UART0_InChar();
    while (character != CR_U) {  // accepts until <enter> is typed
                                 // The next line checks that the input is a digit, 0-9.
                                 // If the character is not 0-9, it is ignored and not echoed
        if ((character >= '0') && (character <= '9')) {
            number = 10 * number + (character - '0');  // this line overflows if above 4294967295
            length++;
            UART0_OutChar(character);
        }
        // If the input is a backspace, then the return number is
        // changed and a backspace is outputted to the screen
        else if ((character == BS) && length) {
            number /= 10;
            length--;
            UART0_OutChar(character);
        }
        character = UART0_InChar();
    }
    return number;
}

