1066mutex/QP_keil_based_tm4c123/bsp.c
//-----------------------UART0_OutUDec-----------------------
// Output a 32-bit number in unsigned decimal format
// Input: 32-bit number to be transferred
// Output: none
// Variable format 1-10 digits with no space before or after
void UART0_OutUDec(uint32_t n) {
    // This function uses recursion to convert decimal number
    //   of unspecified length as an ASCII string
    if (n >= 10) {
        UART0_OutUDec(n / 10);
        n = n % 10;
    }
    UART0_OutChar(n + '0'); /* n is between 0 and 9 */
}

//---------------------UART0_InUHex----------------------------------------
// Accepts ASCII input in unsigned hexadecimal (base 16) format
// Input: none
// Output: 32-bit unsigned number
// No '$' or '0x' need be entered, just the 1 to 8 hex digits
// It will convert lower case a-f to uppercase A-F
//     and converts to a 16 bit unsigned number
//     value range is 0 to FFFFFFFF
// If you enter a number above FFFFFFFF, it will return an incorrect value
// Backspace will remove last digit typed
uint32_t UART0_InUHex(void) {
    uint32_t number = 0;
    uint32_t digit = 0;
    uint32_t length = 0;

    char character;
    character = UART0_InChar();
    while (character != CR_U) {
        digit = 0x10;  // assume bad
        if ((character >= '0') && (character <= '9')) {
            digit = character - '0';
        } else if ((character >= 'A') && (character <= 'F')) {
            digit = (character - 'A') + 0xA;
        } else if ((character >= 'a') && (character <= 'f')) {
            digit = (character - 'a') + 0xA;
        }
        // If the character is not 0-9 or A-F, it is ignored and not echoed
        if (digit <= 0xF) {
            number = number * 0x10 + digit;
            length++;
            UART0_OutChar(character);
        }
        // Backspace outputted and return value changed if a backspace is inputted
        else if ((character == BS) && length) {
            number /= 0x10;
            length--;
            UART0_OutChar(character);
        }
        character = UART0_InChar();
    }
    return number;
}

//--------------------------UART0_OutUHex----------------------------
// Output a 32-bit number in unsigned hexadecimal format
// Input: 32-bit number to be transferred
// Output: none
// Variable format 1 to 8 digits with no space before or after
void UART0_OutUHex(uint32_t number) {
    // This function uses recursion to convert the number of
    //   unspecified length as an ASCII string
    if (number >= 0x10) {
        UART0_OutUHex(number / 0x10);
        UART0_OutUHex(number % 0x10);
    } else {
        if (number < 0xA) {
            UART0_OutChar(number + '0');
        } else {
            UART0_OutChar((number - 0x0A) + 'A');
        }
    }
}
//--------------------------UART0_OutUHex2----------------------------
// Output a 32-bit number in unsigned hexadecimal format
// Input: 32-bit number to be transferred
// Output: none
// Fixed format 2 digits with no space before or after
void outnibble(uint32_t n) {
    if (n < 0xA) {
        UART0_OutChar(n + '0');
    } else {
        UART0_OutChar((n - 0x0A) + 'A');
    }
}
void UART0_OutUHex2(uint32_t number) {
    outnibble(number / 0x10);  // ms digit
    outnibble(number % 0x10);  // ls digit
}
//------------UART0_InString------------
// Accepts ASCII characters from the serial port
//    and adds them to a string until <enter> is typed
//    or until max length of the string is reached.
// It echoes each character as it is inputted.
// If a backspace is inputted, the string is modified
//    and the backspace is echoed
// terminates the string with a null character
// uses busy-waiting synchronization on RDRF
// Input: pointer to empty buffer, size of buffer
// Output: Null terminated string
// -- Modified by Agustinus Darmawan + Mingjie Qiu --
void UART0_InString(char *bufPt, uint16_t max) {
    int length = 0;
    char character;
    character = UART0_InChar();
    while (character != CR_U) {
        if (character == BS) {
            if (length) {
                bufPt--;
                length--;
                UART0_OutChar(BS);
            }
        } else if (length < max) {
            *bufPt = character;
            bufPt++;
            length++;
            UART0_OutChar(character);
        }
        character = UART0_InChar();
    }
    *bufPt = 0;
}

typedef struct {
    char messBuff[20];  // TODO: make sure the correct buffer size is used, char timeout
    uint8_t idx;
    char data;
    enum UARTstate { WAITING_FOR_START = 1,
                     GOT_START } state;
} URT_t;
URT_t uart1;

void UART1_IRQHandler(void);  // prototype
// at least one of two things has happened:
// hardware RX FIFO goes from 1 to 2 or more items
// UART receiver has timed out
// TODO: needs refectoring 
void UART1_IRQHandler(void) {
    URT_t *uartPtr = &uart1;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    uint32_t status = UART1->RIS;               /* get the raw interrupt status */
    UART1->ICR = status;                        /* clear the asserted interrupts */
    while (((UART1->FR & UART_FR_RXFE) == 0)) { /* while RX FIFO NOT empty */
        uartPtr->data = UART1_CHAR;
        UART0_OutChar(uartPtr->data);
        // look for start token;
        if (uartPtr->data == BLE_FRAME_START_TOKEN) {
            uartPtr->state = GOT_START;
        }
        // save the data
        if (uartPtr->state == GOT_START) {
            uartPtr->messBuff[uartPtr->idx] = uartPtr->data;
            uartPtr->idx++;
        }
    }
    // check for end
    if (uartPtr->data == BLE_FRAME_STOP_TOKEN) {
        UartEvt *character = Q_NEW_FROM_ISR(UartEvt, NEW_UART_DATA_SIG);
        // copy buffer into event buffer and add '\0' at the end.
        for (int i = 0; i < uartPtr->idx; i++) {
            character->rxString[i] = uartPtr->messBuff[i];
        }
        character->rxString[uartPtr->idx - 1] = '\0';
        // reset buffer memory
        memset(uartPtr->messBuff, '\0', uartPtr->idx);
        uartPtr->idx = 0;
        uartPtr->state = WAITING_FOR_START;
        // post Evt.
        QACTIVE_POST_FROM_ISR(AO_BLE_uart,
                              (QEvt *)character,
                              &xHigherPriorityTaskWoken,
                              &UART0_IRQHandler);
    }

    /* let FreeRTOS determine if context switch is needed...  */
    portEND_SWITCHING_ISR(xHigherPriorityTaskWoken);
}



